"""
Напишите скрипт, который выводит на экран числа от 1 до 100. 
При этом вместо чисел, кратных 3, программа должна выводить слово «Fizz»,
а вместо чисел, кратных 5 — слово «Buzz».
"""

# s = ["Fizz Buzz" if i % 5 == 0 and i % 3 == 0
#      else "Fizz" if i % 3 == 0
#      else "Buzz" if i % 5 == 0
#      else i for i in range(1, 101)]
# print(s)
